ГТС/УТГТС/InformationRegisters/ПростыеЗвонки_ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПростыеЗвонки_ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефонаС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаНа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеЗвонка</Name>
					<Comment>0 - Входящий 1 - Исходящий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицоПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ПростыеЗвонки_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПростыеЗвонки_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/CommonModules/ПростыеЗвонки_ОбщийМодуль_Сервер/Ext/Module.bsl
Функция ПолучитьВнутреннийНомерПользователя(ТекПользователь =  Неопределено) Экспорт
	
	//Если ТекПользователь = Неопределено Тогда
	//	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПользователиКонтактнаяИнформация.НомерТелефона
	//               |ИЗ
	//               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	//               |ГДЕ
	//               |	ПользователиКонтактнаяИнформация.Ссылка = &Ссылка
	//               |	И ПользователиКонтактнаяИнформация.Вид = &Вид";
	//
	//Запрос.УстановитьПараметр("Ссылка",	ТекПользователь);
	//Запрос.УстановитьПараметр("Вид",		Справочники.ВидыКонтактнойИнформации.ПростыеЗвонкиТелефон);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	//Иначе
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	Возврат Выборка.НомерТелефона;
	//КонецЕсли;
	
КонецФункции
 
Функция ПреобразоватьНомерТелефона(НомерТелефона) Экспорт
	
	ТолькоЦифрыНомера = "";
	Для а=1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТолькоЦифрыНомера;
	
КонецФункции


Функция ПолучитьКлиентаПоНомеруТелефона(НомерТелефона) Экспорт
	//ASP. Добавил в запросы сортировку по ссылке для обработки случая когда есть несколько партнеров с одинаковым номером, что бы при нескольких вызовах функции возвращался один и тот же партнер 
	//ГТС убрали сортировку по ссылке и поставили сортировку по дате регистрации, так как высвечивало старые контакты при дубляже
	
	СтруктураКлиентов = Новый Структура();
	СтруктураКлиентов.Вставить("Партнер",			Неопределено);
	СтруктураКлиентов.Вставить("Контрагент", 		Неопределено);
	СтруктураКлиентов.Вставить("КонтактноеЛицо",	Неопределено);
	
	НомерТелефонаСтрокой	= ПреобразоватьНомерТелефона(СокрЛП(НомерТелефона));			   
	НомерТелефонаЧислом		= Число(НомерТелефонаСтрокой);			   
	
	НомерТелефонаПраваяЧасть = НомерТелефонаСтрокой;
	
	КоличествоПоследнихЦифрНомера = ПолучитьЗначениеНастройки("КоличествоПоследнихЦифрНомера");
	Если НЕ ЗначениеЗаполнено(КоличествоПоследнихЦифрНомера) Тогда
		КоличествоПоследнихЦифрНомера = 5;
	КонецЕсли;
	
	Если СтрДлина(НомерТелефонаСтрокой)>КоличествоПоследнихЦифрНомера Тогда
		НомерТелефонаПраваяЧасть = Прав(НомерТелефонаСтрокой,КоличествоПоследнихЦифрНомера);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефонаСтрокой);
	Запрос.УстановитьПараметр("НомерТелефонаПраваяЧасть", НомерТелефонаПраваяЧасть);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
	               |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец КАК Партнер,
	               |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец.ДатаРегистрации КАК ВладелецДатаРегистрации
	               |ИЗ
	               |	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	               |ГДЕ
	               |	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И (КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона = &НомерТелефона
	               |			ИЛИ КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО ""%"" + &НомерТелефонаПраваяЧасть)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВладелецДатаРегистрации УБЫВ ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СтруктураКлиентов.Партнер = Выборка.Партнер;
		СтруктураКлиентов.КонтактноеЛицо = Выборка.КонтактноеЛицо;
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
		               |	КонтрагентыКонтактнаяИнформация.Ссылка.Партнер КАК Партнер,
		               |	КонтрагентыКонтактнаяИнформация.Ссылка.Партнер.ДатаРегистрации КАК ПартнерДатаРегистрации
		               |ИЗ
		               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		               |ГДЕ
		               |	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		               |	И (КонтрагентыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		               |			ИЛИ КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО ""%"" + &НомерТелефонаПраваяЧасть)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ПартнерДатаРегистрации УБЫВ";

		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			СтруктураКлиентов.Партнер = Выборка.Партнер;
			СтруктураКлиентов.Контрагент = Выборка.Контрагент;
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер,
			               |	ПартнерыКонтактнаяИнформация.Ссылка.ДатаРегистрации КАК ДатаРегистрации
			               |ИЗ
			               |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
			               |ГДЕ
			               |	ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			               |	И (ПартнерыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
			               |			ИЛИ ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО ""%"" + &НомерТелефонаПраваяЧасть)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ДатаРегистрации УБЫВ";

			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				
				СтруктураКлиентов.Партнер = Выборка.Партнер;
				
			КонецЕсли;   
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураКлиентов;		   
	
КонецФункции

Функция ПолучитьПользователяПоНомеруТелефона(НомерТелефона) Экспорт

	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.НомерТелефона = &НомерТелефона
	               |	И ПользователиКонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("НомерТелефона",	НомерТелефона);
	Запрос.УстановитьПараметр("Вид",			Справочники.ВидыКонтактнойИнформации.ПростыеЗвонкиТелефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьПолучателяПоВходящемуНомеру(НомерТелефона) Экспорт
	
	СтруктураКлиентов = ПолучитьКлиентаПоНомеруТелефона(НомерТелефона);
	
	Если ЗначениеЗаполнено(СтруктураКлиентов.Партнер) Тогда
		ОсновнойМенеджерПартнера = СтруктураКлиентов.Партнер.ОсновнойМенеджер;
		Если ЗначениеЗаполнено(ОсновнойМенеджерПартнера) Тогда
			Возврат ПолучитьВнутреннийНомерПользователя(ОсновнойМенеджерПартнера);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьУИДТекущегоПользователя() Экспорт
			
	Возврат СокрЛП(ПараметрыСеанса.ТекущийПользователь.УникальныйИдентификатор());
	
КонецФункции

Функция ПолучитьВремяИзUnixTimestamp(Значение)
	
	Возврат МестноеВремя('19700101' + Значение);
	
КонецФункции

Функция СоздатьДокументТелефонныйЗвонок(НомерС,НомерНа,Направление,Знач ДатаВремяНачала = Неопределено,Знач ДатаВремяОкончания = Неопределено) Экспорт
	
	Если Направление = 1 Тогда
		СтруктураКлиентов	= ПолучитьКлиентаПоНомеруТелефона(СокрЛП(НомерНа));
		Пользователь		= ПолучитьПользователяПоНомеруТелефона(СокрЛП(НомерС));	
	Иначе
		СтруктураКлиентов	= ПолучитьКлиентаПоНомеруТелефона(СокрЛП(НомерС));
		Пользователь		= ПолучитьПользователяПоНомеруТелефона(СокрЛП(НомерНа));	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(СтруктураКлиентов.Партнер) Тогда
		Если Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
			Попытка			
				НовыйТелефонныйЗвонок = Документы.ТелефонныйЗвонок.СоздатьДокумент();
				Если ДатаВремяНачала = Неопределено Тогда
					НовыйТелефонныйЗвонок.Дата = ТекущаяДата();
				Иначе
					НовыйТелефонныйЗвонок.Дата	 = ПолучитьВремяИзUnixTimestamp(ДатаВремяНачала);
				КонецЕсли;	
				
				Если Направление = 1 Тогда
					НовыйТелефонныйЗвонок.АбонентКакСвязаться = СокрЛП(НомерНа);
				Иначе
					НовыйТелефонныйЗвонок.АбонентКакСвязаться = СокрЛП(НомерС);
					НовыйТелефонныйЗвонок.Входящий = Истина;
				КонецЕсли;
			
				НовыйТелефонныйЗвонок.АбонентКонтакт = СтруктураКлиентов.Партнер;
			//из старого модуля
			//	Если ЗначениеЗаполнено( СтруктураКлиентов.Партнер) Тогда
			//	АбонентКонтакт=СтруктураКлиентов.Партнер;
			//Иначе
			//	АбонентКонтакт=СтруктураКлиентов.КонтактноеЛицо;
			//КонецЕсли;
			//
			//НовыйТелефонныйЗвонок.АбонентКонтакт = АбонентКонтакт;
				
				НовыйТелефонныйЗвонок.Автор = Пользователь;
				НовыйТелефонныйЗвонок.Ответственный = Пользователь;
				
				ПредставлениеАбонента = СокрЛП(СтруктураКлиентов.КонтактноеЛицо);
				Если ЗначениеЗаполнено(ПредставлениеАбонента) Тогда
                    ПредставлениеАбонента = ПредставлениеАбонента + "("+СокрЛП(СтруктураКлиентов.Партнер)+")";
				Иначе
					ПредставлениеАбонента = СокрЛП(СтруктураКлиентов.Партнер);
				КонецЕсли;
				
				НовыйТелефонныйЗвонок.АбонентПредставление = ПредставлениеАбонента;
				
				Попытка
					НовыйТелефонныйЗвонок.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					НовыйТелефонныйЗвонок.Записать();
				КонецПопытки;
			
            	Возврат НовыйТелефонныйЗвонок.Ссылка;
			Исключение
			КонецПопытки;			
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Пользователь) И Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
		Попытка			
				НовыйТелефонныйЗвонок = Документы.ТелефонныйЗвонок.СоздатьДокумент();
				Если ДатаВремяНачала = Неопределено Тогда
					НовыйТелефонныйЗвонок.Дата = ТекущаяДата();
				Иначе
					НовыйТелефонныйЗвонок.Дата	 = ПолучитьВремяИзUnixTimestamp(ДатаВремяНачала);
				КонецЕсли;	
				Если Направление = 1 Тогда
					НовыйТелефонныйЗвонок.АбонентКакСвязаться = СокрЛП(НомерНа);
				Иначе
					НовыйТелефонныйЗвонок.АбонентКакСвязаться = СокрЛП(НомерС);
					НовыйТелефонныйЗвонок.Входящий = Истина;
				КонецЕсли;
				НовыйТелефонныйЗвонок.Автор = Пользователь;
				НовыйТелефонныйЗвонок.Ответственный = Пользователь;
				Если ЗначениеЗаполнено(ПредставлениеАбонента) Тогда
                    ПредставлениеАбонента = ПредставлениеАбонента + "("+СокрЛП(НомерС)+")";
				Иначе
					ПредставлениеАбонента = СокрЛП(НомерС);
				КонецЕсли;
				НовыйТелефонныйЗвонок.АбонентПредставление = ПредставлениеАбонента;
				Попытка
					НовыйТелефонныйЗвонок.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					НовыйТелефонныйЗвонок.Записать();
				КонецПопытки;
            	Возврат НовыйТелефонныйЗвонок.Ссылка;
			Исключение
			КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СохранитьИсториюЗвонка(НомерС, НомерНа, Продолжительность, ДатаВремяНачала, ДатаВремяОкончания, Направление, ПутьКЗаписи, ИД) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("НомерИсходящегоЗвонка",Неопределено);
	СтруктураРезультата.Вставить("СозданныйТелефонныйЗвонок",Неопределено);
	
	УИД = Прав("000000000000000"+Строка(ДатаВремяОкончания),15) + Прав("000000000000000"+Строка(ИД),15);
	
	Пользователь	= Неопределено;
	
	Если Направление = 1 Тогда
		СтруктураКлиентов	= ПолучитьКлиентаПоНомеруТелефона(СокрЛП(НомерНа));
		Пользователь		= ПолучитьПользователяПоНомеруТелефона(СокрЛП(НомерС));	
	Иначе
		СтруктураКлиентов	= ПолучитьКлиентаПоНомеруТелефона(СокрЛП(НомерС));
		Пользователь		= ПолучитьПользователяПоНомеруТелефона(СокрЛП(НомерНа));	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПростыеЗвонки_ИсторияЗвонков.УИД
	               |ИЗ
	               |	РегистрСведений.ПростыеЗвонки_ИсторияЗвонков КАК ПростыеЗвонки_ИсторияЗвонков
	               |ГДЕ
	               |	ПростыеЗвонки_ИсторияЗвонков.УИД = &УИД";
	
	Запрос.УстановитьПараметр("УИД",УИД);
	
	ЗаписьНеСуществует = Запрос.Выполнить().Пустой();
	
	Если ЗаписьНеСуществует Тогда
		
		Запись = РегистрыСведений.ПростыеЗвонки_ИсторияЗвонков.СоздатьМенеджерЗаписи();
		Запись.УИД = УИД;
		
		Запись.НомерТелефонаС		= СокрЛП(НомерС);
		Запись.НомерТелефонаНа		= СокрЛП(НомерНа);
		
		Запись.ДатаВремяНачала		= ПолучитьВремяИзUnixTimestamp(ДатаВремяНачала);
		Запись.ДатаВремяОкончания	= ПолучитьВремяИзUnixTimestamp(ДатаВремяОкончания);
		
		Запись.Продолжительность	= Продолжительность;
		Запись.НаправлениеЗвонка	= Направление;
		Запись.ПутьКФайлу			= ПутьКЗаписи;
		
		Запись.Партнер					= СтруктураКлиентов.Партнер;
		Запись.Контрагент				= СтруктураКлиентов.Контрагент;
		Запись.КонтактноеЛицоПартнера	= СтруктураКлиентов.КонтактноеЛицо;
		Запись.Пользователь 			= Пользователь;
		
		Запись.Записать();
		
	КонецЕсли;

	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПолучитьТекущегоПользователя() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ПолучитьЦифрыСтроки(НомерТелефона)
	
	НомерТелефонаЧисла = "";
	
	ДлинаСтроки = СтрДлина(НомерТелефона);
	
	Для н = 1 по ДлинаСтроки Цикл
		Символ = Сред(НомерТелефона,н,1);
		Если Найти("0123456789", Символ)>0 Тогда
			НомерТелефонаЧисла = НомерТелефонаЧисла + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерТелефонаЧисла;
	
КонецФункции

Функция ПолучитьНомерТелефонаВнутриГорода(НомерТелефона) Экспорт
	
	ПростыеЗвонкиКодыГородов = ПростыеЗвонки_ОбщийМодуль_СерверПеременные.ПолучитьТаблицуКодовГородов();
	
	НомерТелефонаВнутриГорода = ПолучитьЦифрыСтроки(НомерТелефона);
	
	Если СтрДлина(НомерТелефонаВнутриГорода)>=10 Тогда
		
		ТелефонСКодом = Прав(НомерТелефонаВнутриГорода,10);
		
		Если НЕ Лев(ТелефонСКодом,1) = "9" Тогда
			
			КодГорода			= "";
			НомерВнутриГорода	= "";
			
			Для н = 1 по 6 Цикл
				
				ДлинаКодаГорода = 8-н;
				
				КодГорода = Лев(ТелефонСКодом,ДлинаКодаГорода);
				
				НайденнаяСтрока = ПростыеЗвонкиКодыГородов.Найти(КодГорода,"КодГорода");
				Если НЕ НайденнаяСтрока = Неопределено Тогда
					
					НомерТелефонаВнутриГорода	= Сред(ТелефонСКодом,ДлинаКодаГорода+1);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			НомерТелефонаВнутриГорода = ТелефонСКодом;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат НомерТелефонаВнутриГорода;
	
КонецФункции

Функция ПолучитьПредставлениеНомераТелефона(НомерТелефона,Местонахождение = "",ГородскойМобильный = "") Экспорт
	
	ПростыеЗвонкиКодыГородов				= ПростыеЗвонки_ОбщийМодуль_СерверПеременные.ПолучитьТаблицуКодовГородов();
	ПростыеЗвонкиКодыМобильныхОператоров	= ПростыеЗвонки_ОбщийМодуль_СерверПеременные.ПолучитьТаблицуКодовМобильныхОператоров();
	
	ПредставлениеТелефона = "";
	
	ГородскойМобильный = "Городской";
	
	НомерТелефонаЧисла = ПолучитьЦифрыСтроки(НомерТелефона);
	
	Если СтрДлина(НомерТелефонаЧисла)>=10 Тогда
		
		КодСтраны = "";
		Если СтрДлина(НомерТелефонаЧисла)>10 Тогда
			КодСтраны = Лев(НомерТелефонаЧисла,СтрДлина(НомерТелефонаЧисла)-10);
		КонецЕсли;
			
		ТелефонСКодом = Прав(НомерТелефонаЧисла,10);
		
		Если Лев(ТелефонСКодом,1) = "9" Тогда
			
			ГородскойМобильный = "Мобильный";
			
			КодОператора = Лев(ТелефонСКодом,3);
			НомерВнутриОператора = Сред(ТелефонСКодом,4);
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("КодОператора",КодОператора);
			
			ТаблицаМобильногоОператора = ПростыеЗвонкиКодыМобильныхОператоров.Скопировать(СтруктураОтбора);
			Для Каждого Стр Из ТаблицаМобильногоОператора Цикл
				
				Если НомерВнутриОператора>=Стр.НомерС И НомерВнутриОператора <= Стр.НомерПо Тогда
					
					Местонахождение = Стр.Регион;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ПредставлениеТелефона = СокрЛП(КодСтраны+" ("+КодОператора+") "+Лев(НомерВнутриОператора,3)+"-"+Сред(НомерВнутриОператора,4,2)+"-"+Прав(НомерВнутриОператора,2));
			
		Иначе
			
			КодГорода			= "";
			НомерВнутриГорода	= "";
			
			НашлиКодГорода = Ложь;
			
			Для н = 1 по 6 Цикл
				
				ДлинаКодаГорода = 8-н;
				
				КодГорода = Лев(ТелефонСКодом,ДлинаКодаГорода);
				
				НайденнаяСтрока = ПростыеЗвонкиКодыГородов.Найти(КодГорода,"КодГорода");
				Если НЕ НайденнаяСтрока = Неопределено Тогда
					
					НомерВнутриГорода	= Сред(ТелефонСКодом,ДлинаКодаГорода+1);
					Местонахождение		= НайденнаяСтрока.Город;
					
					НашлиКодГорода = Истина;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НашлиКодГорода Тогда
				
				Если СтрДлина(КодГорода) > 5 Тогда
					ПредставлениеТелефона = "("+КодГорода+") "+СокрЛП(НомерВнутриГорода);
				ИначеЕсли СтрДлина(КодГорода) = 5 Тогда
					ПредставлениеТелефона = "("+КодГорода+") "+Лев(НомерВнутриГорода,1)+"-"+Сред(НомерВнутриГорода,2,2)+"-"+Прав(НомерВнутриГорода,2);
				ИначеЕсли СтрДлина(КодГорода) = 4 Тогда
					ПредставлениеТелефона = "("+КодГорода+") "+Лев(НомерВнутриГорода,2)+"-"+Сред(НомерВнутриГорода,3,2)+"-"+Прав(НомерВнутриГорода,2);
				ИначеЕсли СтрДлина(КодГорода) = 3 Тогда
					ПредставлениеТелефона = "("+КодГорода+") "+Лев(НомерВнутриГорода,3)+"-"+Сред(НомерВнутриГорода,4,2)+"-"+Прав(НомерВнутриГорода,2);
				ИначеЕсли СтрДлина(КодГорода) = 2 Тогда
					ПредставлениеТелефона = "("+КодГорода+") "+Лев(НомерВнутриГорода,3)+"-"+Сред(НомерВнутриГорода,4,3)+"-"+Прав(НомерВнутриГорода,2);
				КонецЕсли;
				
				ПредставлениеТелефона = СокрЛП(КодСтраны + " " + ПредставлениеТелефона);
				
			Иначе
				
				ПредставлениеТелефона = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПредставлениеТелефона = "" Тогда
		ПредставлениеТелефона = НомерТелефона;
	КонецЕсли;
	
	Возврат ПредставлениеТелефона;
	
КонецФункции


Процедура УстановитьНомерТелефонаНовогоОбъекта(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если Форма.Параметры.ЗначенияЗаполнения.Свойство("ПростыеЗвонки_НомерТелефона") Тогда
		
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;

		Иначе
			Возврат;
		КонецЕсли;
		
		НомерТелефона = Форма.Параметры.ЗначенияЗаполнения.ПростыеЗвонки_НомерТелефона;
		
		НовыйТелефон = Объект.КонтактнаяИнформация.Добавить();
		НовыйТелефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйТелефон.Вид = ВидКИ;
		НовыйТелефон.Представление = НомерТелефона;
		НовыйТелефон.ЗначенияПолей = "НомерТелефона="+СокрЛП(НомерТелефона);
		НовыйТелефон.НомерТелефона = НомерТелефона;
		НовыйТелефон.НомерТелефонаБезКодов = ПолучитьЦифрыСтроки(НомерТелефона);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьПраваНаПростыеЗвонки() Экспорт
	
	Если РольДоступна("ASP_ПростыеЗвонки") 
			// ГТС изменено 25.01.2017
		// ИЛИ РольДоступна("ПолныеПрава") 
		ИЛИ ИмяПользователя()="Слободян Юрий"
		
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьЗначениеНастройки(ИмяНастройки,Значение) Экспорт
	
	ЗаписьНастройки = РегистрыСведений.ПростыеЗвонки_Настройки.СоздатьМенеджерЗаписи();
	ЗаписьНастройки.ИмяНастройки = СокрЛП(ИмяНастройки);
	ЗаписьНастройки.Значение = Значение;
	ЗаписьНастройки.Записать();
	
КонецПроцедуры

Функция ПолучитьЗначениеНастройки(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПростыеЗвонки_Настройки.Значение
	               |ИЗ
	               |	РегистрСведений.ПростыеЗвонки_Настройки КАК ПростыеЗвонки_Настройки
	               |ГДЕ
	               |	ПростыеЗвонки_Настройки.ИмяНастройки = &ИмяНастройки";
				   
	Запрос.УстановитьПараметр("ИмяНастройки",ИмяНастройки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Значение;
	КонецЕсли;
				   
КонецФункции

Функция ПроверитьПервыйЗапуск() Экспорт
	
	Если ПолучитьЗначениеНастройки("ПервыйЗапуск") = Неопределено Тогда
		
		ВидПростыеЗвонки = Справочники.ВидыКонтактнойИнформации.ПростыеЗвонкиТелефон;
		Если Не ЗначениеЗаполнено(ВидПростыеЗвонки.Тип) Тогда
			ВидПростыеЗвонкиОбъект = ВидПростыеЗвонки.ПолучитьОбъект();
			ВидПростыеЗвонкиОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			ВидПростыеЗвонкиОбъект.Записать();
		КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	    	           |	ПрофилиГруппДоступаРоли.Ссылка
	        	       |ИЗ
	            	   |	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	               	   |ГДЕ
		               |	ПрофилиГруппДоступаРоли.Роль = ""ПростыеЗвонки""";
				   
		РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
		
			НовыйПрофиль = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
			НовыйПрофиль.Наименование = "Простые звонки";
			НовыйПрофиль.Родитель = Справочники.ПрофилиГруппДоступа.Прочее;
		
			НоваяСтрока = НовыйПрофиль.Роли.Добавить();
			НоваяСтрока.Роль = "ПростыеЗвонки";
		
			НовыйПрофиль.Записать();
		
			НоваяГруппаДоступа = Справочники.ГруппыДоступа.СоздатьЭлемент();
			НоваяГруппаДоступа.Наименование = "Простые звонки";
			НоваяГруппаДоступа.Профиль = НовыйПрофиль.Ссылка;
		
			НоваяГруппаДоступа.Записать();
		
		КонецЕсли;
		
		ИдентификаторБазы1С = СокрЛП(Новый УникальныйИдентификатор());
		УстановитьЗначениеНастройки("ИдентификаторБазы1С", ИдентификаторБазы1С);

		УстановитьЗначениеНастройки("ПервыйЗапуск", "1")
	КонецЕсли;
		
КонецФункции



Процедура ASP_ЗаполненияАбонентовВИсторииЗвонковПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Или Не ПростыеЗвонки_ОбщийМодуль_Сервер.ЕстьПраваНаПростыеЗвонки() Тогда
		Возврат;
	КонецЕсли;
	
	
	//ASP. Ищем в истории звонков по текущему номеру и пустому абоненту, и заполняем недостающую информацию	
	НомераТелефоновАбонента=Источник.КонтактнаяИнформация.Выгрузить(Новый Структура("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон)).ВыгрузитьКолонку("НомерТелефона");
	
	ТипАбонента=Строка(ТипЗнч(Источник.Ссылка));
	
	Если ТипАбонента="Контактное лицо" Тогда
		ТипАбонента="КонтактноеЛицоПартнера";
	КонецЕсли;
	
	ЗапросИсторииЗвонковПоАбоненту = Новый Запрос;
	ЗапросИсторииЗвонковПоАбоненту.Текст = 
	"ВЫБРАТЬ
	|	ПростыеЗвонки_ИсторияЗвонков.УИД,
	|	ПростыеЗвонки_ИсторияЗвонков.Партнер,
	|	ПростыеЗвонки_ИсторияЗвонков.Пользователь,
	|	ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаС,
	|	ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаНа,
	|	ПростыеЗвонки_ИсторияЗвонков.Продолжительность,
	|	ПростыеЗвонки_ИсторияЗвонков.ДатаВремяНачала,
	|	ПростыеЗвонки_ИсторияЗвонков.ДатаВремяОкончания,
	|	ПростыеЗвонки_ИсторияЗвонков.НаправлениеЗвонка,
	|	ПростыеЗвонки_ИсторияЗвонков.ПутьКФайлу,
	|	ПростыеЗвонки_ИсторияЗвонков.Контрагент,
	|	ПростыеЗвонки_ИсторияЗвонков.КонтактноеЛицоПартнера,
	|	ПростыеЗвонки_ИсторияЗвонков.Сделка
	|ИЗ
	|	РегистрСведений.ПростыеЗвонки_ИсторияЗвонков КАК ПростыеЗвонки_ИсторияЗвонков
	|ГДЕ
	|	(ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаС В (&НомераТелефоновАбонента)
	|			ИЛИ ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаНа В (&НомераТелефоновАбонента))
	|	И ВЫБОР
	|			КОГДА &ТипАбонента = ""Партнер""
	|				ТОГДА ПростыеЗвонки_ИсторияЗвонков.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			КОГДА &ТипАбонента = ""КонтактноеЛицоПартнера""
	|				ТОГДА ПростыеЗвонки_ИсторияЗвонков.КонтактноеЛицоПартнера = ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			КОГДА &ТипАбонента = ""Контрагент""
	|				ТОГДА ПростыеЗвонки_ИсторияЗвонков.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	ЗапросИсторииЗвонковПоАбоненту.УстановитьПараметр("НомераТелефоновАбонента", НомераТелефоновАбонента);
	ЗапросИсторииЗвонковПоАбоненту.УстановитьПараметр("ТипАбонента", ТипАбонента);
	
	РезультатЗапросаИсторииЗвонковПоАбоненту = ЗапросИсторииЗвонковПоАбоненту.Выполнить();
	
	ВыборкаИсторииЗвонковПоАбоненту = РезультатЗапросаИсторииЗвонковПоАбоненту.Выбрать();
	
	СтруктураЗаполнения=Новый Структура;
	СтруктураЗаполнения.Вставить(ТипАбонента,Источник.Ссылка);
	
	Если ТипАбонента="КонтактноеЛицоПартнера" Тогда
		СтруктураЗаполнения.Вставить("Партнер",Источник.Ссылка.Владелец);	
	ИначеЕсли ТипАбонента="Контрагент" Тогда
		СтруктураЗаполнения.Вставить("Партнер",Источник.Ссылка.Партнер);	
	КонецЕсли;
	

	
	Пока ВыборкаИсторииЗвонковПоАбоненту.Следующий() Цикл
		МенеджерЗаписиИсторииЗвонков=РегистрыСведений.ПростыеЗвонки_ИсторияЗвонков.СоздатьМенеджерЗаписи();
		
		//ASP. Удаляю старую запись регистра
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиИсторииЗвонков,ВыборкаИсторииЗвонковПоАбоненту);
		МенеджерЗаписиИсторииЗвонков.Удалить();
		
		//ASP.Запишу обновленную запись регистра
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиИсторииЗвонков,ВыборкаИсторииЗвонковПоАбоненту);
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиИсторииЗвонков,СтруктураЗаполнения);
		МенеджерЗаписиИсторииЗвонков.Записать();
	КонецЦикла;
	

КонецПроцедуры

Процедура ASP_ЗаполнениеСделокВИсторииЗвонковПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Или Не ЗначениеЗаполнено(Источник.ТелефонныйЗвонок) Или Не ПростыеЗвонки_ОбщийМодуль_Сервер.ЕстьПраваНаПростыеЗвонки() Тогда
		Возврат;
	КонецЕсли;
	
	Сделка=Источник.Ссылка;
	Пользователь=ПараметрыСеанса.ТекущийПользователь;
	НомерТелефона=Источник.ТелефонныйЗвонок.АбонентКакСвязаться;
	
	ЗапросНаличияЗаписиВИсторииЗвонков = Новый Запрос;
	ЗапросНаличияЗаписиВИсторииЗвонков.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписьИстории
	|ИЗ
	|	РегистрСведений.ПростыеЗвонки_ИсторияЗвонков КАК ПростыеЗвонки_ИсторияЗвонков
	|ГДЕ
	|	ПростыеЗвонки_ИсторияЗвонков.Сделка = &Сделка
	|	И ПростыеЗвонки_ИсторияЗвонков.Пользователь = &Пользователь
	|	И ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаС = &НомерТелефона";
	
	ЗапросНаличияЗаписиВИсторииЗвонков.УстановитьПараметр("Сделка", Сделка);
	ЗапросНаличияЗаписиВИсторииЗвонков.УстановитьПараметр("Пользователь", Пользователь);
	ЗапросНаличияЗаписиВИсторииЗвонков.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	Если Не ЗапросНаличияЗаписиВИсторииЗвонков.Выполнить().Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ЗапросПоследнегоЗвонкаБезСделки	 = Новый Запрос;
	ЗапросПоследнегоЗвонкаБезСделки.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПростыеЗвонки_ИсторияЗвонков.УИД,
	|	ПростыеЗвонки_ИсторияЗвонков.Партнер,
	|	ПростыеЗвонки_ИсторияЗвонков.Пользователь,
	|	ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаС,
	|	ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаНа,
	|	ПростыеЗвонки_ИсторияЗвонков.Продолжительность,
	|	ПростыеЗвонки_ИсторияЗвонков.ДатаВремяНачала,
	|	ПростыеЗвонки_ИсторияЗвонков.ДатаВремяОкончания,
	|	ПростыеЗвонки_ИсторияЗвонков.НаправлениеЗвонка,
	|	ПростыеЗвонки_ИсторияЗвонков.ПутьКФайлу,
	|	ПростыеЗвонки_ИсторияЗвонков.Контрагент,
	|	ПростыеЗвонки_ИсторияЗвонков.КонтактноеЛицоПартнера,
	|	ПростыеЗвонки_ИсторияЗвонков.Сделка
	|ИЗ
	|	РегистрСведений.ПростыеЗвонки_ИсторияЗвонков КАК ПростыеЗвонки_ИсторияЗвонков
	|ГДЕ
	|	ПростыеЗвонки_ИсторияЗвонков.Пользователь = &Пользователь
	|	И ПростыеЗвонки_ИсторияЗвонков.НомерТелефонаС = &НомерТелефона
	|	И ПростыеЗвонки_ИсторияЗвонков.Сделка = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПростыеЗвонки_ИсторияЗвонков.ДатаВремяНачала УБЫВ";
	
	ЗапросПоследнегоЗвонкаБезСделки.УстановитьПараметр("НомерТелефона", НомерТелефона);
	ЗапросПоследнегоЗвонкаБезСделки.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапросаПоследнегоЗвонкаБезСделки = ЗапросПоследнегоЗвонкаБезСделки.Выполнить();
	
	Если РезультатЗапросаПоследнегоЗвонкаБезСделки.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаЗапросаПоследнегоЗвонкаБезСделки = РезультатЗапросаПоследнегоЗвонкаБезСделки.Выбрать();
	ВыборкаЗапросаПоследнегоЗвонкаБезСделки.Следующий();
	
	//ASP. Поставляю в последнюю запись истории звонков текущую сделку
	МенеджерЗаписиИсторииЗвонков=РегистрыСведений.ПростыеЗвонки_ИсторияЗвонков.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписиИсторииЗвонков,ВыборкаЗапросаПоследнегоЗвонкаБезСделки);
	МенеджерЗаписиИсторииЗвонков.Сделка=Сделка;
	МенеджерЗаписиИсторииЗвонков.Записать();
	
	
КонецПроцедуры
